{
  "key": {
    "t": "title",
    "s": "subtitle",
    "i": "img",
    "d": "img description",
    "p": "text"
  },

  "t_0": "Build Our Machine.",
  "p_0": "For tis animation, I wanted to capture the old, vintage animation style of cartoons and film by using modern-day technologies with older effects overlayed on top to make the film feel older. This, coupled with the dark themes of the song, led me to create a old-time music video with some dark scenes.",
  "s_0": "Write-On Letter",
  "p_1": "For the first part of the animation, I had a separate composition with script text that I would use masks to show over time. I wanted to achieve a write-on effect this way.",
  "i_2": "build-our-machine/text-mask.png",
  "d_2": "Using masks as a write-on effect for text",
  "p_3": "I attached these compositions to a paper texture so that when the paper would float up and down, the text would follow. On top of the paper, I added a few ink splatters that were video clips of ink transition effects. I freeze framed the same video clip in two locations, one earlier where there is less ink, and one later with more ink. The clip with greater ink had a lower opacity to show the fading of ink from the area.",
  "i_4": "build-our-machine/paper-ink.png",
  "d_4": "Attaching fading ink splatters to the paper",
  "p_5": "From the original 'Build Our Machine' music video, I masked out 4 frames of the Bendy dancing animation and looped it to the music. Using edge detection and alpha-matting to a rough texture, I outlined the Bendy figure to look like a drawing and parented him onto the corner of the paper as well.",
  "i_6": "build-our-machine/bendy-dance.png",
  "d_6": "Generating a hand-drawn effect for Bendy",
  "p_6": "As for the moving floor below the letter, I used the floor asset from the game and repeated the layer vertically in a separate composition. By attaching everything to a null object, I could animate the position and scale to make it seem as if we are walking on the floor.",
  "p_7": "On top of the floor, I also added the ink bleeding animation over each tile. As the camera would move further and further, more ink would engulf the floor. This was tricky since, unlike the floor tiles, the ink bleeds did not repeat at the edges. I countered this by bringing the clips closer and masking their edges so that they would fade into one another and seem more continuous.",
  "i_8": "build-our-machine/repeated-floor.png",
  "d_8": "Tiling the floor panels and ink bleeds together",

  "s_9": "Ink Text",
  "p_10": "I generated the ink text in the chorus by drawing the outlines in pen on paper, and going back to fill the letters in pen as well.",
  "i_11": "build-our-machine/ink-text-01.jpg",
  "d_11": "Drawing outlines and fills using pen",
  "p_12": "I found drawing fills using pen to be ineffective since it was a slow process, would waste a lot of ink (I only has 3 pens the semester), and still left a lot of unfilled areas. To compromise, I continued using pen for outlines, but switched to sharpies when filling for the above reasons.",
  "i_13": "build-our-machine/ink-text-02.jpg",
  "d_13": "Switching to sharpie for remaining text",
  "p_14": "I took pictures of the text and brought them into Illustrator where I would live-trace the text. This gave higher contrast for the text, as well as making the text look a lot more blotchy.",
  "i_15": "build-our-machine/ink-text-03.png",
  "d_15": "Live tracing hand-drawn text",
  "p_16": "There were areas where the text felt empty, or there was not enough blotchy-ness. Using a graphics tablet, I drew in additional strokes to highlight these features and make the text feel more drippy.",
  "i_17": "build-our-machine/ink-text-04.png",
  "d_17": "Adding additional features to text",

  "s_18": "Character Silhouette Puppets",
  "p_19": "I began sketching different common death scenes on paper and matching scenes with text to get an idea of what went where.",
  "p_20": "In Photoshop, I drew the outlines and filled them in with the same color to make a silhouette. I was careful to keep the background and foreground different layers so that I could animate them separately.",
  "i_21": "build-our-machine/character-silhouette.png",
  "d_21": "Character silhouette from hanging scene",

  "s_22": "Composing Footage",
  "p_23": "In After Effects, I used the wall and floor tiles to create a 3D environment from 2D layers. To each wall, I attached ink splatters and the ink text from Illustrator.",
  "i_24": "build-our-machine/chorus-environment.png",
  "d_24": "Constructing the 3D space from 2D tiles",
  "p_25": "For the actual text, I masked it with the ink bleed transition to give the edges more of an ink feel. This required duplicating the text and ink bleed layers to achieve that ink fade-out effect discussed earlier.",
  "i_26": "build-our-machine/chorus-text.jpg",
  "d_26": "Close up of lyrics",
  "p_27": "As for the silhouettes, I brought them into separate compositions and used simple transformation properties and the puppet tool to animate them. Because each scene wouldn't appear for more than a few seconds, I had to be careful to make the keyframes quick as to play within the few seconds I had, but not too fast that it's not understood what's going on.",
  "i_28": "build-our-machine/puppet.png",
  "d_28": "Puppet animation of downing scene",
  "p_29": "I attached each silhouette composition with the corresponding text in the main composition, lowered the opacity, and added a blur on the edges.",
  "p_30": "In order to get the silhouette to occupy the ground and roof as well, I duplicated the silhouettes, rotated them 90 degrees in the y-axis, and raised or lowered them until they were aligned with the roof or ground. Though, because the ground and roof were long, and that they seemed short because of perspective, I had to stretch the silhouettes 5x to make them appear normal and not squished.",
  "i_31": "build-our-machine/chorus-shadows.png",
  "d_31": "Adding animated silhouettes behind the text",

  "s_32": "Frame Animation",
  "p_33": "For the animation segment at the end, I rendered out a short audio clip so that I could align the animation to the audio. I began by drawing rough keyframes every couple of frames to get a feel for the animation, and then went back and added additional frames to smoothen it out.",
  "i_34": "build-our-machine/animatic.gif",
  "d_34": "Final scene animatic",
  "p_35": "I drew the final animation over the animatic, being cautious to make sure all my drawings were closed so that I could use the fill tool on them. I added some dash lines to areas where the character would move fast to add a cartoon-like motion blur.",
  "p_36": "When composing the animation in After Effects, I couldn't keep the character black since it wouldn't be seen against the black background. To compromise, I changed the fill to a dusty brown and alpha-matted a rusty texture on top.",
  "i_37": "build-our-machine/animatic-comparison.png",
  "d_37": "Animatic and composed animation comparison",

  "s_38": "Post-Production",
  "p_39": "To make the video look more like old-fashioned film, I added additional static effect overlays. Using the noise & grain effect, I randomly generated lines and spline clumps that would act like static. I added an additional brightness adjustment layer and keyframed it to flicker over time. Around the composition, I placed multiple vignettes. To finish it off, I added a particle effect and tweaked the parameters to have the particles float around the canvas. I used color correction to give the overall composition a tan-ish brown look."
}
