{
    "key": {
      "t": "title",
      "s": "subtitle",
      "i": "img",
      "d": "img description",
      "p": "text"
    },
  
    "i_0": "dsg-university/splash.png",
    "t_0": "DSG University.",
    "w_0": [{"code-icon.png": "React [JS], Django [Python], Mapbox API, Big Huge Thesaurus API, Summa NLP Extension"},
            {"time-icon.png": "8 Weeks"}],
    "p_1": "DSG University was a summer-long project provided by Dick's Sporting Goods that attempted to leverage coach-to-coach communication to improve coach learning. Through extensive researching, interviewing, and brainstorming, our team of 5 engineers, 3 designers, and 1 project manager decided on building a progressive web application that allowed coaches to share content such as sports articles and drills, create discussion forums, & track nearby coaches and events using geolocations to encourage a community of discussions between coaches.",
    "s_2": "Onboarding.",
    "p_3": "When first entering the site, we provide new users with a brief survey asking about their coaching experience, sports, age groups, and other crucial information that can be used to provide them a more personalized experience when using the site. They are given the ability to register their first team, and additionan teams during this process.",
    "i_4": "dsg-university/onboarding.png",
    "d_4": "Onboarding Introduction Page.",
    "p_5": "The progression bar at the bottom of the page notifies the user of their status in completing the onboarding steps. Once the onboarding pages are completed, the user is taken to the login/registration page where they can create a new account or sign in with an existing one. Account registration and authentication is handles using Django's built-in authentication request package.",
    "s_6": "Profile Customization.",
    "p_7": "Users can further customize their profile, such as adjusting what sports they are interested in, their skill level in coaching particular sports, and their geolocation for where they most frequently coach. These properties can later be used to query for other coaches with similar skills and interests, and the location property allows coaches to find other coaches and events nearby.",
    "i_8": "dsg-university/profile.png",
    "d_9": "Viewing Personal Profile Features.",
    "p_10": "Coaches can also add multiple teams to their account, and switch between teams to get a more customized experience per team. Content pertaining to basketball will be more likely to show up if you coach a basketball team and so forth. Each team can be given a name, age range, number of players, and sport type. This information is useful in allowing other coaches who view your profile to see what teams you coach and connect based on similar team sports, sizes, and age ranges.",
    "i_11": "dsg-university/teams.png",
    "d_12": "Viewing/Adding Teams to an Account.",
    "s_13": "Searching For Coaches.",
    "p_14": "You can use location, sports, and name information of another coach to search for them in a database of coaches. Searching uses substring matching to identify if the search query matches any property of the coach's profile. Once a query term is entered, the results are filtered to only show coaches with a property relevant to the searched term.",
    "i_15": "dsg-university/coaches.png",
    "d_16": "Coach Searching.",
    "p_17": "When clicking on a coach's name, you are brought to their profile page where you can view more information about them, such as the sports they are interested in, their coaching experience, and where they coach. The design of this subpage is very similar to the profile editing page.",
    "p_18": "Coaches can also use the integrated Mapbox API feature to search for coaches using geolocations. The map initially renders the starting position as the coach's home location, showing coaches and sports events within a pre-determined radius, although the coach can also move around and search coaches within other regions as well. Each marker is generated by grabbing latitude & longitude coordinates from the database & generating icons with on-click popups at each of these locations. These markers are tracked onto and move around with them map.",
    "i_19": "dsg-university/maps.png",
    "d_19": "Tracking Coaches & Events Using the Mapbox API.",
    "p_20": "Hovering over a blue icon will expand the icon to show the coach's profile picture, and clicking on the icon will display a pop-up containing the coach's name and additional information. Clicking the coach's name will redirect the url to view the coach's profile page.",
    "p_21": "Alongside coaches, the map also displays markers for nearby sports games. Depending on the team selected, coaches can view sports games for that particular sport. So if you are browsing with your basketball team selected, basketball markers indicating nearby basketball games will appear on the map. Clicking them will show the name of the game, followed by the address, time, and coach. This encourages coaches to shadow other coaches by going to their games and learning more of the skills they have when coaching.",
    "p_22": "Coaches can also create their own events on the map as well. By inputting the sports team, time, address, and selecting the corresponding geolocation that the coach would want the event to appear on the map, then the event will be viewable for other coaches to discover if they have a registered team of the same sport.",
    "s_23": "Forums.",
    "p_24": "For questions coaches may have with practices, a game, or even getting their athletes involved or more engaged, the forums tab is a great place to ask a question and get responses from other coaches. For each forum question, other coaches have the ability to like the original question if they feel it is an important question or if they have the same question, and can post comments to the questions either answering it or further asking questions. Each comment can be liked by another coach, and comments are ranked in terms of number of likes.",
    "i_25": "dsg-university/forums.png",
    "d_25": "Viewing a Forum Post & Reply.",
    "s_26": "Articles.",
    "p_27": "At the heart of DSG University is the ability to create, share, and view sports articles ranging from drills to tips & tricks to even advice to keeping in shape. Each article stores the time it takes on average to perform the activity, thee number of likes given by other coaches, and a list of tags such as the sport type, difficulty, and other important tags that can help other coaches find the article.",
    "i_28": "dsg-university/article_search.png",
    "d_28": "Article Search Interface.",
    "p_29": "At the top, users can select the sport type and difficulty level to narrow down their search. To the right is a search-bar that coaches can use to search for specific tags. On runtime, the program gets a cumulative list of tags from all articles and uses substring logic to display autocomplete predictions for search queries when the user starts typing. In the case above, typing in 'bas' is a substring for the tags 'baseball', 'basketball', and 'basic'. Clicking any of these will populate the searchbar with that tag and filter the article results to only show articles including the searched tag.",
    "p_30": "The searchbar also makes a call to the Big Huge Thesaurus API to get a list of synonyms for the searched team in the searchbar. The synonyms returned are then added in as filters, and so long as an article contains one of the filters, it is displayed. This way, typing in words like 'simple' will still yield articles with the tag 'basic'.",
    "p_31": "Coaches can click on the title of an article to view the content pertaining to that article. In this view, coaches will see an extended body of text describing the article, as well as the name of the author and a link to the source.",
    "i_32": "dsg-university/article_view.png",
    "d_32": "Article View Display.",
    "p_33": "Within the article, coaches have the ability to like the article, as well as save it to their list of quick-access articles. Below the article is a commenting view similar to the one in the forums display where coaches can leave questions, comments, or supportive feedback about the article, as well as like other comments. Comments again are displayed in order of number of likes.",
    "p_34": "When an article is saved, its top-left corner lights up green in the article search interface to indicate this. This article will now appear in the 'Saved Articles' tab along with other saved articles for quick access",
    "i_35": "dsg-university/article_save.png",
    "d_35": "List of Saved Articles.",
    "p_36": "Coaches can also create their own articles to share with the community. In the 'My Articles' tab, the coach can add a new article, which will lead them to a new page where they can fill out details such as article title, background image, description, what sport the article pertains to, how long it is estimated to take, as well as tags used for searching and discovery.",
    "i_37": "dsg-university/article_create.png",
    "d_37": "Create An Article.",
    "p_38": "As the user populates these fields, the article display to the right updates in real-time, showing the user what the article will look like in the search page. This can be useful in determining if an article title is too long, or if a background image is not the right aspect ratio. Users can also choose to post an article anonymously and not include their name.",
    "p_39": "Once a user inputs a description, a request is sent to the backend to parse the description and use the python summa NLP module to determine the most important words in the description. This method is based of the text rank scheme where individual words are assigned an importance weight based on their frequency in the description, where words that tend to occur often in multiple articles are penalized for not being unique to that article description. This knowledge of the most important words in the article is sent back to the frontend and given to the user as predictions for what tags they should use for the article. Clicking on a predicted tag below the tags input field will add the tag to the article display, and clicking on the tag on the article display will remove the tag.",
    "s_40": "Final Thoughts.",
    "p_41": "DSG University was a rigorous project without much starter material provided in the beginning. With a dedicated team of interns, we were able to move forward quickly and conduct the necessary preliminary research through interviews and brainstorming sessions that allowed us to move in the rapid pace we needed to in order to finish this project in 8 weeks.",
    "p_42": "I wanted to especially thank my team Cristina Dunning [UX], Monica Chang [UX], Sarina Katznelson [UX], Molly Hughes [Engineer], Marissa Beighley [Engineer], Rahul Kamat [Engineer], Chris Mankos [Engineer], and Sanjeev Malladi [PM] for their amazing help and support in this project. They were a great team, and even better friends."
}
  